*** make a new virtualenv
#+BEGIN_SRC shell
pwd
#+END_SRC

#+RESULTS:
: /Users/anoop/ml/flipshope


Use :session: property to speed up org-babel when possible to use the same session
#+BEGIN_SRC bash :session session007 :results output
    source ~/.bashrc
    #mkvirtualenv mlm
    workon mlm
    which python
    #+END_SRC

#+RESULTS:
: /Users/anoop/ml/flipshope ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
: :/Users/anoop/ml/flipshope ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
: :(mlm) /Users/anoop/ml/flipshope ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
: :/Users/anoop/.virtualenvs/mlm/bin/python
: (mlm) /Users/anoop/ml/flipshope ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#+BEGIN_SRC elisp :session session007 :results output
  (pyvenv-workon "mlm")
#+END_SRC

#+RESULTS:

*** check if properly isntalled using .__version _ after import

using python snippets inside orgmode https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html
installed python-mode from package-list-packages for emacs
#+BEGIN_SRC python
    print("hello")
  return 1
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC python

#+END_SRC

